In [ ]:
!pip install requests bs4 scikit-learn tweepy kiwipiepy IPython

In [ ]:
!pip install scipy numpy matplotlib seaborn statsmodels openpyxl

In [2]:
import pandas as pd

sample_data = {"a":[4,5,6],
               "b":[7,8,9],
               "c":[10,11,12]}

df = pd.DataFrame(sample_data)
df_index = pd.DataFrame(sample_data, index=[1,2,3])

In [2]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

## PIVOT 실습
1. 데이터를 추출

In [3]:
df_1 = pd.DataFrame(
    [[4, 7, 10],
     [5, 8, 11],
     [6, 9, 12]],
     index=[1, 2, 3],
     columns=['a', 'b', 'c']
)

In [4]:
df_1

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [94]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [92]:
df.pivot(index='foo', columns='bar', values='baz')

bar    A    B    C    D
foo
one  1.0  2.0  3.0  NaN
two  4.0  5.0  NaN  6.0

In [93]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz              zoo
bar   A  B    C    D   A  B    C    D
foo
one   1  2    3  NaN   x  y    z  NaN
two   4  5  NaN    6   q  w  NaN    t

## CONCAT 실습
1. 데이터를 합칠 때 사용하는 함수 중 하나
2. 열 이름이 서로 일치하면 밑으로 연결됨.

3. 합쳐야 할 데이터프레임끼리 열 이름이 서로 일치하지 않다면 결측치로 처리함

In [110]:
data1 = [['a',1],
         ['b', 2]]
data2 = [['c',3],
         ['d', 4]]

df1 = pd.DataFrame(data1, columns=['letter', 'number'])
df2 = pd.DataFrame(data2, columns=['letter', 'number'])

display(df1)
display(df2)

  letter  number
0      a       1
1      b       2

  letter  number
0      c       3
1      d       4

In [ ]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [15]:
df3 = pd.DataFrame([['e', 5, 'cat'], ['f', 6, 'dog']], columns=['letter', 'number', 'animal'])
pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      e       5    cat
1      f       6    dog

In [17]:
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      e       5
1      f       6

In [18]:
df4 = pd.DataFrame([['bird' ,'polly'], ['monkey' ,'george']], columns=['animal' ,'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [ ]:
#가로 방향으로 합치기 axis=1
pd.concat([df1, df4], axis=1)

## sort_value()
1. 데이터를 정렬

In [3]:
import numpy as np

df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})
display(df)

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [4]:
df.sort_values(by=['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [5]:
df.sort_values(by=['col1'], ascending=False)

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

In [6]:
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [7]:
df.sort_values(by='col1', ascending=False, na_position='first')

  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

## 인덱스 재정렬

In [8]:
df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150], columns=['A'])
df

     A
100  1
29   2
234  3
1    4
150  5

In [9]:
df.sort_index()

     A
1    4
29   2
100  1
150  5
234  3

In [10]:
df.sort_index(ascending=False)

     A
234  3
150  5
100  1
29   2
1    4

In [16]:
#reset_index()
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                   index=['falcon', 'parrot', 'lion', 'monkey'],
                   columns=('class', 'max_speed'))

df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [12]:
df.reset_index()
#기존 인덱스가 열로 이동

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [15]:
df.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

In [18]:
help(df.reset_index)

Help on method reset_index in module pandas.core.frame:

reset_index(level: 'IndexLabel | None' = None, *, drop: 'bool' = False, inplace: 'bool' = False, col_level: 'Hashable' = 0, col_fill: 'Hashable' = '', allow_duplicates: 'bool | lib.NoDefault' = <no_default>, names: 'Hashable | Sequence[Hashable] | None' = None) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Reset the index, or a level of it.

    Reset the index of the DataFrame, and use the default one instead.
    If the DataFrame has a MultiIndex, this method can remove one or more
    levels.

    Parameters
    ----------
    level : int, str, tuple, or list, default None
        Only remove the given levels from the index. Removes all levels by
        default.
    drop : bool, default False
        Do not try to insert index into dataframe columns. This resets
        the index to the default integer index.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    col_level : int or str, default 0
        If the columns have multiple levels, determines which level the
        labels are inserted into. By default it is inserted into the first
        level.
    col_fill : object, default ''
        If the columns have multiple levels, determines how the other
        levels are named. If None then the index name is repeated.
    allow_duplicates : bool, optional, default lib.no_default
        Allow duplicate column labels to be created.

        .. versionadded:: 1.5.0

    names : int, str or 1-dimensional list, default None
        Using the given string, rename the DataFrame column which contains the
        index data. If the DataFrame has a MultiIndex, this has to be a list or
        tuple with length equal to the number of levels.

        .. versionadded:: 1.5.0

    Returns
    -------
    DataFrame or None
        DataFrame with the new index or None if ``inplace=True``.

    See Also
    --------
    DataFrame.set_index : Opposite of reset_index.
    DataFrame.reindex : Change to new indices or expand indices.
    DataFrame.reindex_like : Change to same indices as other DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame([('bird', 389.0),
    ...                    ('bird', 24.0),
    ...                    ('mammal', 80.5),
    ...                    ('mammal', np.nan)],
    ...                   index=['falcon', 'parrot', 'lion', 'monkey'],
    ...                   columns=('class', 'max_speed'))
    >>> df
             class  max_speed
    falcon    bird      389.0
    parrot    bird       24.0
    lion    mammal       80.5
    monkey  mammal        NaN

    When we reset the index, the old index is added as a column, and a
    new sequential index is used:

    >>> df.reset_index()
        index   class  max_speed
    0  falcon    bird      389.0
    1  parrot    bird       24.0
    2    lion  mammal       80.5
    3  monkey  mammal        NaN

    We can use the `drop` parameter to avoid the old index being added as
    a column:

    >>> df.reset_index(drop=True)
        class  max_speed
    0    bird      389.0
    1    bird       24.0
    2  mammal       80.5
    3  mammal        NaN

    You can also use `reset_index` with `MultiIndex`.

    >>> index = pd.MultiIndex.from_tuples([('bird', 'falcon'),
    ...                                    ('bird', 'parrot'),
    ...                                    ('mammal', 'lion'),
    ...                                    ('mammal', 'monkey')],
    ...                                   names=['class', 'name'])
    >>> columns = pd.MultiIndex.from_tuples([('speed', 'max'),
    ...                                      ('species', 'type')])
    >>> df = pd.DataFrame([(389.0, 'fly'),
    ...                    (24.0, 'fly'),
    ...                    (80.5, 'run'),
    ...                    (np.nan, 'jump')],
    ...                   index=index,
    ...                   columns=columns)
    >>> df
                   speed species
                     max    type
    class  name
    bird   falcon  389.0     fly
           parrot   24.0     fly
    mammal lion     80.5     run
           monkey    NaN    jump

    Using the `names` parameter, choose a name for the index column:

    >>> df.reset_index(names=['classes', 'names'])
      classes   names  speed species
                         max    type
    0    bird  falcon  389.0     fly
    1    bird  parrot   24.0     fly
    2  mammal    lion   80.5     run
    3  mammal  monkey    NaN    jump

    If the index has multiple levels, we can reset a subset of them:

    >>> df.reset_index(level='class')
             class  speed species
                      max    type
    name
    falcon    bird  389.0     fly
    parrot    bird   24.0     fly
    lion    mammal   80.5     run
    monkey  mammal    NaN    jump

    If we are not dropping the index, by default, it is placed in the top
    level. We can place it in another level:

    >>> df.reset_index(level='class', col_level=1)
                    speed species
             class    max    type
    name
    falcon    bird  389.0     fly
    parrot    bird   24.0     fly
    lion    mammal   80.5     run
    monkey  mammal    NaN    jump

    When the index is inserted under another level, we can specify under
    which one with the parameter `col_fill`:

    >>> df.reset_index(level='class', col_level=1, col_fill='species')
                  species  speed species
                    class    max    type
    name
    falcon           bird  389.0     fly
    parrot           bird   24.0     fly
    lion           mammal   80.5     run
    monkey         mammal    NaN    jump

    If we specify a nonexistent level for `col_fill`, it is created:

    >>> df.reset_index(level='class', col_level=1, col_fill='genus')
                    genus  speed species
                    class    max    type
    name
    falcon           bird  389.0     fly
    parrot           bird   24.0     fly
    lion           mammal   80.5     run
    monkey         mammal    NaN    jump

## 값을 지우는 drop(), dropna()

In [19]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [20]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [21]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [22]:
df.drop(index=[0, 1], columns=['B', 'C'])

   A   D
2  8  11

In [23]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy":[np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [np.nan, "1940-04-25", np.nan]})
df

       name        toy        born
0    Alfred        NaN         NaN
1    Batman  Batmobile  1940-04-25
2  Catwoman   Bullwhip         NaN

In [24]:
df.dropna()

     name        toy        born
1  Batman  Batmobile  1940-04-25

In [25]:
df.dropna(axis=1)

       name
0    Alfred
1    Batman
2  Catwoman

In [26]:
df.dropna(subset=['name', 'toy'])

       name        toy        born
1    Batman  Batmobile  1940-04-25
2  Catwoman   Bullwhip         NaN

#  데이터 추출
- 단순하게 데이터를 정리할 목적으로만 추출

In [27]:
import pandas as pd
df = pd.DataFrame({"ID": [1, 2, 3, 3, 5],
                   "국어": [80, 90, 75, 75, 90],
                   "영어": [85, 100, 70, 70, 95],
                   "수학": [75, 95, 65, 65, 80]})
df

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65
4   5  90   95  80

In [112]:
help(df.drop_duplicates)

Help on method drop_duplicates in module pandas.core.frame:

drop_duplicates(subset: 'Hashable | Sequence[Hashable] | None' = None, *, keep: 'DropKeep' = 'first', inplace: 'bool' = False, ignore_index: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Return DataFrame with duplicate rows removed.

    Considering certain columns is optional. Indexes, including time indexes
    are ignored.

    Parameters
    ----------
    subset : column label or sequence of labels, optional
        Only consider certain columns for identifying duplicates, by
        default use all of the columns.
    keep : {'first', 'last', ``False``}, default 'first'
        Determines which duplicates (if any) to keep.

        - 'first' : Drop duplicates except for the first occurrence.
        - 'last' : Drop duplicates except for the last occurrence.
        - ``False`` : Drop all duplicates.

    inplace : bool, default ``False``
        Whether to modify the DataFrame rather than creating a new one.
    ignore_index : bool, default ``False``
        If ``True``, the resulting axis will be labeled 0, 1, …, n - 1.

    Returns
    -------
    DataFrame or None
        DataFrame with duplicates removed or None if ``inplace=True``.

    See Also
    --------
    DataFrame.value_counts: Count unique combinations of columns.

    Examples
    --------
    Consider dataset containing ramen rating.

    >>> df = pd.DataFrame({
    ...     'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    ...     'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    ...     'rating': [4, 4, 3.5, 15, 5]
    ... })
    >>> df
        brand style  rating
    0  Yum Yum   cup     4.0
    1  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    3  Indomie  pack    15.0
    4  Indomie  pack     5.0

    By default, it removes duplicate rows based on all columns.

    >>> df.drop_duplicates()
        brand style  rating
    0  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    3  Indomie  pack    15.0
    4  Indomie  pack     5.0

    To remove duplicates on specific column(s), use ``subset``.

    >>> df.drop_duplicates(subset=['brand'])
        brand style  rating
    0  Yum Yum   cup     4.0
    2  Indomie   cup     3.5

    To remove duplicates and keep last occurrences, use ``keep``.

    >>> df.drop_duplicates(subset=['brand', 'style'], keep='last')
        brand style  rating
    1  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    4  Indomie  pack     5.0

In [28]:
df[['국어', '영어']]

   국어   영어
0  80   85
1  90  100
2  75   70
3  75   70
4  90   95

In [29]:
df[df['국어'] > 80]

   ID  국어   영어  수학
1   2  90  100  95
4   5  90   95  80

In [42]:
df['국어'] > 80

0    False
1     True
2    False
3    False
4     True
Name: 국어, dtype: bool

In [43]:
df.drop_duplicates()

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
4   5  90   95  80

In [44]:
df.drop_duplicates(subset='국어')

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65

In [45]:
df.head(2)

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95

In [46]:
df.tail(2)

   ID  국어  영어  수학
3   3  75  70  65
4   5  90  95  80

In [47]:
df.sample(2)

   ID  국어   영어  수학
2   3  75   70  65
1   2  90  100  95

In [52]:
df.sample(frac=0.6)

   ID  국어   영어  수학
4   5  90   95  80
1   2  90  100  95
3   3  75   70  65

# iloc[]와 loc[]
1. iloc와 loc도 데이터를 행을 기준으로 추출할 때 사용하는 함수이다.
2. 이 둘의 차이점은 iloc[]는 번호를 사용해서 데이터를 추출할 인덱스와 열을 지정하고
3. loc[]는 열 이름을 지정한다.
4. iloc[행 시작 번호:행 종료 번호, 열 시작 번호:열 종료 번호]

In [40]:
df.iloc[0,2]

np.int64(85)

In [41]:
df.iloc[1:3]

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65

In [53]:
df.iloc[:,:]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65
4   5  90   95  80

In [54]:
df.iloc[1:4,:]

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65

In [55]:
df.iloc[1:4,:0]

Empty DataFrame
Columns: []
Index: [1, 2, 3]

In [56]:
df.loc[:,['국어','영어']]

   국어   영어
0  80   85
1  90  100
2  75   70
3  75   70
4  90   95

In [57]:
df.loc[:0, ['국어','영어']]

   국어  영어
0  80  85

In [59]:
df.loc[df['국어']>=80, ['수학']]

   수학
0  75
1  95
4  80

# 논리 연산자
1. python -> a and b // pandas -> a & b
2. python -> a or b // pandas -> a | b
3. python -> not a // pandas -> ~ a

In [61]:
df[df['국어']==75]

   ID  국어  영어  수학
2   3  75  70  65
3   3  75  70  65

In [ ]:
df[df['국어']!=75]

In [ ]:
df[df['국어']>=80]

In [ ]:
df[(df['영어']>=80)&(df['국어']>=80)]

In [ ]:
df[(df['수학']>=70)|(df['국어']>=80)]

In [62]:
df[~(df['수학']>=70)]

   ID  국어  영어  수학
2   3  75  70  65
3   3  75  70  65

# 데이터 요약
* 요약된 데이터는 전체 데이터 특징을 간단하고 정확히 정리함.

In [97]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"ID":[1, 2, 3, 4, 5],
                   "국어":[80, 90, 75, 100, 80],
                   "영어":[85, 100, 70, 70, 75],
                   "수학":[75, 95, 65, 95, np.nan]})
df

   ID   국어   영어    수학
0   1   80   85  75.0
1   2   90  100  95.0
2   3   75   70  65.0
3   4  100   70  95.0
4   5   80   75   NaN

In [98]:
df['영어'].value_counts()

영어
70     2
85     1
100    1
75     1
Name: count, dtype: int64

In [99]:
df.shape

(5, 4)

In [100]:
df['영어'].nunique()

4

In [101]:
df['영어'].unique()

array([ 85, 100,  70,  75])

In [102]:
df.describe()

             ID     국어          영어    수학
count  5.000000    5.0    5.000000   4.0
mean   3.000000   85.0   80.000000  82.5
std    1.581139   10.0   12.747549  15.0
min    1.000000   75.0   70.000000  65.0
25%    2.000000   80.0   70.000000  72.5
50%    3.000000   80.0   75.000000  85.0
75%    4.000000   90.0   85.000000  95.0
max    5.000000  100.0  100.000000  95.0

In [103]:
df.sum()

ID     15.0
국어    425.0
영어    400.0
수학    330.0
dtype: float64

In [104]:
df[['국어', '영어', '수학']].sum()

국어    425.0
영어    400.0
수학    330.0
dtype: float64

In [105]:
df[['국어', '영어', '수학']].median()

국어    80.0
영어    75.0
수학    85.0
dtype: float64

In [106]:
df['수학'].std()

np.float64(15.0)

# 결측치 처리
* dropna() 함수는 결측치를 삭제
* fillna()는 결측치에 특정값을 채우는 함수

In [85]:
df.fillna(60)

   ID   국어   영어    수학
0   1   80   85  75.0
1   2   90  100  95.0
2   3   75   70  65.0
3   4  100   70  95.0
4   5   80   75  60.0

In [ ]:
df.fillna(df['수학'].mean())

# 열 생성
*

In [ ]:
df = pd.DataFrame({"A":range(1, 13), "B":np.random.randint(0, 12, size=12)})
df.head()

In [ ]:
df.assign(plus=lambda x:df['A'] + df['B'])

In [ ]:
df['plus_pu'] = df['A'] + df['B']

In [ ]:
df

In [ ]:
df = pd.DataFrame({"A":range(1, 13), "B":np.random.randint(0, 12, size=12)})
df['plus'] = df['A'] + df['B']

pd.qcut(df['plus'], 3, labels={"A", "B", "C"})

In [ ]:
df['category'] = pd.qcut(df['plus'], 3, labels={"A", "B", "C"})
df

# 데이터 그룹화
* 데이터를 그룹화한다는 것은 데이터 프레임에서 필요한 기준에 따라 새롭게 데이터 프레임을 정렬하는 것
* 큰 데이터를 가져오기 위해 시각화 라이브러리 seaborn을 가져온다.

In [87]:
import seaborn as sns

df = sns.load_dataset("mpg")
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [88]:
df.groupby(by="origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [89]:
df.groupby(by="origin").min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [90]:
df.groupby(by="origin").mean(numeric_only=True)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [ ]:
df.groupby(by="origin")[["horsepower", "weight"]].mean()

## 순위를 구할 때 사용하는 rank()

In [86]:
df = sns.load_dataset("mpg")

print(df['cylinders'].unique())
display(df.head(3))
display(df.tail(3))

NameError: name 'sns' is not defined

In [ ]:
df['cylinders'].rank(ascending=False,method='min')

In [ ]:
df['cylinders'].rank(method='dense')

In [ ]:
df['cylinders'].rank(ascending=False, method='dense')

# 데이터 병합
* concat() 함수는 데이터를 이어 준다면 merge() 함수는 서로를 자연스럽게 융합시켜 주는 형태

In [107]:
adf = pd.DataFrame({"x1": ["A", "B", "C"], "x2": [1, 2, 3]})
bdf = pd.DataFrame({"x1": ["A", "B", "D"], "x3": ["T", "F", "T"]})

display(adf)
display(bdf)

  x1  x2
0  A   1
1  B   2
2  C   3

  x1 x3
0  A  T
1  B  F
2  D  T

In [108]:
pd.merge(adf, bdf, on='x1')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [ ]:
pd.merge(adf, bdf, how='right', on='x1')

In [ ]:
pd.merge(adf, bdf, how='left', on='x1')

In [ ]:
pd.merge(adf, bdf, how='outer', on='x1')

# 경기도 인구 데이터 분석
https://data.gg.go.kr/portal/data/service/selectServicePage.do?page=1&sortColumn=&sortDirection=&infId=HH7N68ZBMYNCB7QE9OY927342034&infSeq=1&searchWord=%EC%A3%BC%EB%AF%BC%EB%93%B1%EB%A1%9D%EC%9D%B8%EA%B5%AC+%EC%A7%91%EA%B3%84+%ED%98%84%ED%99%A9

In [109]:
import pandas as pd

import matplotlib.pyplot as plt

%matplotlib inline

plt.rc('font', family='Malgun Gothic')
plt.rcParams['axes.unicode_minus'] = False

import IPython.display
from matplotlib_inline.backend_inline import set_matplotlib_formats
IPython.display.set_matplotlib_formats = set_matplotlib_formats('retina')

In [ ]:
filepath = 'C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/주민등록인구집계현황.csv'
population = pd.read_csv(filepath, encoding='euc-kr')
population.head(2)

In [ ]:
print("데이터 크기 :", population.shape)

In [ ]:
population.isnull().sum()

### 젊은 세대가 많이 사는 지역이 어디인지 정의
* 40대 이하 여성이 많이 사는 지역을 젊은 세대가 많이 사는 지역으로 정의
* 40대 이하 여성이 지역 맘카페에 가입하고, 학령기에 들어선 아이들의 학부모이기 때문

10대와 40대가 함께 살고 있으므로 해당 지역은 전체적으로 젊은 지역으로 간주할 수 있음

In [ ]:
popula_female = population.iloc[:, -12:]

popula_info = population.iloc[:, :4]

pop_female_info = pd.concat([popula_info, popula_female], axis=1)

In [ ]:
pop_female_info['연도'].value_counts().sort_index()

In [ ]:
pop_female_info = pop_female_info[pop_female_info['연도'] != 2025]

In [ ]:
pop_female_info.rename(columns={"0~9세 (여)": "10대_미만",
                                "10~19세 (여)": "10대",
                                "20~29세 (여)": "20대",
                                "30~39세 (여)": "30대",
                                "40~49세 (여)": "40대",
                                "50~59세 (여)": "50대",
                                "60~69세 (여)": "60대"
                                }, inplace=True)

In [ ]:
pop_female_info['70대_이상'] = pop_female_info["70~79세 (여)"] + \
                                pop_female_info["80~89세 (여)"] + \
                                pop_female_info["90~99세 (여)"] + \
                                pop_female_info["100세 이상 (여)"]
pop_female_info.info()

In [ ]:
df_female = pop_female_info.drop(['70~79세 (여)', '80~89세 (여)', '90~99세 (여)', '100세 이상 (여)'], axis=1)
df_female.head(2)

행정구역 중에 면, 리는 시골 지역이기 때문에 당연히 40대 이하 인구가 많이 살고 있지 않음 \
행정구역구분면에 '동'을 포함한 행만 가져온다.

In [ ]:
df_female_dong = df_female[df_female['행정구역명'].str.contains('동')]
df_female_dong.head()

__대 이하 여성들의 비율 = __대 이하 인구 합계 ÷ 해당 지역 전체 인구수 × 100

In [ ]:
under40s = df_female_dong['10대_미만'] + df_female_dong['10대'] + df_female_dong['20대'] + df_female_dong['30대'] + df_female_dong['40대']
over50s = df_female_dong['50대'] + df_female_dong['60대'] + df_female_dong['70대_이상']

under40_percent = round((under40s/df_female_dong['총 인구수 (여)']*100), 2)
over50_percent = round((over50s/df_female_dong['총 인구수 (여)']*100), 2)

df_female_dong['40대_이하_여성비율(%)'] = under40_percent
df_female_dong['50대_이상_여성비율(%)'] = over50_percent

df_female_dong[df_female_dong['연도']==2024]

행정구역명 -> 시와 동으로 분리 \
split() 함수 사용

In [ ]:
x = "경기도 고양시 덕양구 고양동"
print("split() 적용 전:", x)
print("split() 적용 후", x.split())
print("동 추출 결과 :", x.split()[-1])
print("시 추출 결과 :", x.split()[1])

In [ ]:
df_female_dong['동'] = df_female_dong['행정구역명'].apply(lambda x:x.split()[-1])
df_female_dong['시'] = df_female_dong['행정구역명'].apply(lambda x:x.split()[1])

In [ ]:
df_female_dong.sample()

시와 동 정보는 하나로 다시 합쳐서 열 추가 \
경기도에 시는 다르지만 동 이름이 같은 경우가 있기 때문

In [ ]:
df_female_dong['시-동'] = df_female_dong['시'] + " " + df_female_dong['동']
df_result = df_female_dong[['연도', '시', '동', '시-동', '총 인구수 (여)', '40대_이하_여성비율(%)', '50대_이상_여성비율(%)']]
df_result.isnull().sum()

데이터 프레임 전체에 연산을 적용하거나 필요한 데이터를 추출할 때마다 결측치를 확인해야 합니다.

In [ ]:
df_result[df_result['40대_이하_여성비율(%)'].isnull()]

In [ ]:
df_result.dropna(inplace=True)
df_result = df_result[df_result['연도']>2015]
df_result.sample(3)

In [ ]:
df_resent_group = df_result.groupby(['시-동'])[['40대_이하_여성비율(%)', "50대_이상_여성비율(%)"]].mean()
df_resent_group.reset_index(inplace=True)
df_resent_group.sort_values(by='40대_이하_여성비율(%)', ascending=False)[:20]

In [ ]:
df_top20 = df_resent_group.sort_values(by='40대_이하_여성비율(%)', ascending=False)[:20]
x = df_top20['시-동']
y = df_top20['40대_이하_여성비율(%)']

plt.figure(figsize=(10, 5))
plt.title("2016 ~ 2021년, 40대 이하 여성이 \n가장 많이 사는 지역 상위 20개 동", fontsize=15)
plt.bar(x, y, alpha=0.7, color='darkgreen')

plt.xticks(size=12, rotation=45)
plt.yticks(size=12)
plt.ylabel("%", size=15)
plt.ylim(70, 90)

plt.grid(True, alpha=0.2)

# 국민건강보험공단 진료 내역 정보 전처리
* 직접 함수를 만들고 데이터를 합치거나 병합하는 과정이 핵심

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

plt.rc('font', family='Malgun Gothic')
import IPython.display
from matplotlib_inline.backend_inline import set_matplotlib_formats
IPython.display.set_matplotlib_formats = set_matplotlib_formats('retina')

doctor_data = pd.read_csv('C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/ph_2023.CSV', encoding='cp949')
doctor_data.head(2)

## 데이터 연결 및 필요한 열만 추출
* 진료과목코드, 주상병코드, 성별코드, 연령대코드를 파악해서 여성들을 나이별로 분류하고 어떤 진료를 자주 받고 어떤 병을 앓고 있는지 파악
* 처방 일수나 보험금 정보는 필요하지 않음

In [ ]:
target_cols = ['성별코드', '연령대코드', '진료과목코드', '주상병코드', '부상병코드']

doctor_data_short = doctor_data[target_cols]

print("2023년 진료행위 총 :", doctor_data_short.shape[0], "회")
doctor_data_short.head(2)

## 다른 데이터와 데이터 합치기 1
* 진료과목코드에 1로 저장되어 있으면 무슨 진료과목인지 알 수 없음.
* 코드 대신 정의로 대체하는 작업 \
url : https://opendata.hira.or.kr/op/opc/selectColumnCodeList.do?tblId=&pageIndex=8

In [ ]:
treat_code = pd.read_excel('C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/컬럼정보_코드.xls')
treat_code = treat_code[treat_code['코드구분']=='진료과목코드']
treat_code.dropna(inplace=True)

treat_code.head(2)

In [ ]:
treat_code = treat_code[['코드','명칭']]
treat_code.rename(columns={'코드':'진료과목코드_str', '명칭':'진료과목'}, inplace=True)

treat_code.head(3)

In [ ]:
# zfill() 함수 실습
code = '1'
print("zfill()에 2로 지정하면", code.zfill(2))
print("zfill()에 3으로 지정하면", code.zfill(3))

In [ ]:
treat_code['진료과목코드_str'] = treat_code['진료과목코드_str'].apply(lambda x:str(x).zfill(2))
treat_code.head(3)

In [ ]:
doctor_data_short['진료과목코드_str'] = doctor_data_short['진료과목코드'].apply(lambda x:str(x).zfill(2))
doctor_data_short.reset_index(drop=True, inplace=True)
doctor_data_short.head(1)

In [ ]:
doctor_data_short = pd.merge(doctor_data_short, treat_code, how='left', on='진료과목코드_str')
doctor_data_short.head(2)

In [ ]:
print('2023년 진료과목별 진료횟수 Top20')
doctor_data_short['진료과목'].value_counts()[:20]

In [ ]:
x_hospitals = list(doctor_data_short['진료과목'].value_counts().index)
y_hos_values = doctor_data_short['진료과목'].value_counts().values
plt.figure(figsize=(6,10))
plt.barh(x_hospitals, y_hos_values)

## 다른 데이터와 데이터 합치기 2
* 상병코드 의미

In [ ]:
#데이터가 저장된 경로로 입력
disease_code = pd.read_csv('C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/건강보험심사평가원_상병마스터_20240131.csv', encoding='cp949')
disease_code.head(2)

In [ ]:
disease_code = disease_code.iloc[:, :2]
disease_code.rename(columns={"상병기호":"주상병코드"}, inplace=True)
disease_code.head(2)

In [ ]:
doctor_data_short = pd.merge(doctor_data_short, disease_code, on='주상병코드', how='left')
doctor_data_short.head(2)

## 함수를 사용한 데이터 처리
* 성별코드와 연령대코드
* 성별코드에서 남자는 1 여자는 0
* 연령대코드는 숫자가 1~17 이상으로 증가

In [ ]:
def findSex(num):
    """성별코드를 해석하는 함수"""
    if num == 1:
        return '남'
    else:
        return '여'
    
def ageCode(num):
    """연령대 분류하는 함수"""
    if (num==1) or (num==2):
        return "9세미만"
    elif (num==3) or (num==4):
        return "10대"
    elif (num==5) or (num==6):
        return "20대"
    elif (num==7) or (num==8):
        return "30대"
    elif (num==9) or (num==10):
        return "40대"
    elif (num==11) or (num==12):
        return "50대"
    elif (num==13) or (num==14):
        return "60대"
    elif (num==15) or (num==16):
        return "70대"
    elif (num==17) or (num==18):
        return "80대"
    else:
        return "80대이상"

In [ ]:
doctor_data_short['성별'] = doctor_data_short['성별코드'].apply(lambda x:findSex(num=x))
doctor_data_short['연령대'] = doctor_data_short['연령대코드'].apply(lambda x:ageCode(num=x))
doctor_data_short.head(3)

In [ ]:
doctor_data_short.to_csv('C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/2023_진료정보.csv', index=False)